SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( rz_tep70-0384
	Type ( Engine )
	WagonShape ( rz_tep70-0384.s )
	FreightAnim ( sdw_70.s 1 1 )
	Size ( 3.2m 5.1m 21.82m )
	Mass ( 135t )
	WheelRadius ( 0.61m )
	InertiaTensor ( Box (3.2m 5.1m 21.82m) )
	
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 2e6N/m 5e6N/m )
			Damping ( 2e6N/m/s 3e6N/m/s )
			Break ( 1.5e7N 1.5e7N )
			r0 ( 10cm 10cm )
		)
		Velocity ( 0.01m/s )
	)
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 2e6N/m 5e6N/m )
			Damping ( 2e6N/m/s 3e6N/m/s )
			Break ( 1.5e7N 1.5e7N )
			r0 ( 10cm 10cm )
		)
		Velocity ( 0.01m/s )
	)

	Adheasion ( 0.56 0.8 3.27 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*135t )
	DerailBufferForce ( 1080kN )
	NumWheels ( 12 )
	Friction (
		2650.00N/m/s	-0.10		1.5mph	17.2N/m/s	1.69
		126N/rad/s		0		0.3rad/s	3		1.6
	)

	IntakePoint ( 3.33 0.4 FuelDiesel )
	IntakePoint ( -3.33 0.4 FuelDiesel )	

	BrakeEquipmentType( "Handbrake, Triple_valve, Auxilary_reservoir" )
	BrakeSystemType( "Air_single_pipe" )

	MaxHandbrakeForce( 13.5kN )
	MaxBrakeForce( 112kN )
	NumberOfHandbrakeLeverSteps( 100 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 2 )
	MaxApplicationRate( 8 )
	MaxAuxilaryChargingRate( 4 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 57 )

	Lights	( 42

		Light	(
			comment( Sphere of light )
			Type( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( fffffbbb )
					Position ( 0.0 3.5 28 )
					Transition ( 0 )
					Radius ( 280.0 )
					Angle ( 15.0 )
					)
				)
			)

		Light	(
			comment( Sphere of light medium )
			Type		( 1 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
			)
			Cycle	( 0 )
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffbb )
					Position ( 0.0 3.5 11 )
					Transition ( 0 )
					Radius ( 90 )
					Angle ( 20 )
					)
				)
		)
			
		Light	(
			comment( Buffer light right dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light left dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Head light top dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.035 )
					Radius ( 0.6 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
						
		Light	(
			comment( Head light top bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 10.721 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.0015 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Red light right rear )
			Type( 0 )
			Conditions (
				Service ( 2 )
				Unit ( 3 )
				TimeOfDay ( 0 )
				)
			FadeIn	( 0.1 )
			FadeOut	( 0.1 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour (F0FF0000 )
					Position ( 0.625 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right night )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				TimeOfDay ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light left night )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				TimeOfDay ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 1 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( 1.56 1.42 -8.66 )
					Azimuth ( 90.0 90.0 90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 2 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -1.56 1.42 -8.66 )
					Azimuth ( -90.0 -90.0 -90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 3 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( 1.56 1.42 -3.45 )
					Azimuth ( 90.0 90.0 90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 4 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -1.56 1.42 -3.45 )
					Azimuth ( -90.0 -90.0 -90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 5 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( 1.56 1.42 3.62 )
					Azimuth ( 90.0 90.0 90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 6 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -1.56 1.42 3.62 )
					Azimuth ( -90.0 -90.0 -90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 7 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( 1.56 1.42 8.37 )
					Azimuth ( 90.0 90.0 90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Side-light 8 )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				Unit ( 0 )
               		TimeOfDay( 2 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -1.56 1.42 8.37 )
					Azimuth ( -90.0 -90.0 -90.0 )
					Transition ( 0.8 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Headlight AI service night )
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.035 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right AI service day rain)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 1 )
                          Weather(2)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left AI service day rain)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 1 )
                          Weather(2)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Headlight AI service day snow )
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.8 )
			FadeOut	( 0.8 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right AI service day snow)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left AI service day snow)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 2 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right front AI out of duty)
			Type( 0 )
			Conditions (
				Service ( 1 )
				Unit ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right rear AI out of duty)
			Type( 0 )
			Conditions (
				Service ( 1 )
				Unit ( 0 )
				TimeOfDay ( 2 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)


		Light	(
			comment( Buffer light right dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light left dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Head light top dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 -10.77 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.035 )
					Radius ( 0.6 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
						
		Light	(
			comment( Head light top bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 -10.771 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.0015 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Red light right rear )
			Type( 0 )
			Conditions (
				Service ( 2 )
				Unit ( 4 )
				TimeOfDay ( 0 )
				)
			FadeIn	( 0.1 )
			FadeOut	( 0.1 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour (F0FF0000 )
					Position ( -0.63 1.72 10.72 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right night )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				TimeOfDay ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light left night )
			Type( 0 )
			Conditions (
				Headlight ( 1 )
				TimeOfDay ( 2 )
				Unit ( 5 )
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Headlight AI service night )
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 -10.77 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.035 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right AI service day rain)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 1 )
                          Weather(2)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 -10.72 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left AI service day rain)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 1 )
                          Weather(2)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Headlight AI service day snow )
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.8 )
			FadeOut	( 0.8 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( fff2da9a )
					Position ( -0 2.77 -10.77 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.2 )
					Radius ( 0.9 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Buffer light right AI service day snow)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( -0.95 1.72 -10.72 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
		Light	(
			comment( Buffer light left AI service day snow)
			Type( 0 )
			Conditions (
                    	  Control ( 1 )
                          Service( 2 )
                          Unit ( 5 )
                          TimeOfDay( 1 )
                          Weather(3)
				)
			FadeIn	( 0.0 )
			FadeOut	( 0.0 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFEDBF5E )
					Position ( 0.95 1.72 -10.72 )
					Azimuth ( -180.0 -180.0 -180.0 )
					Transition ( 0.2 )
					Radius ( 0.3 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

	)
	
     	Sound ( "../../tsrLoco_TEP70-Alias/Sound_2/tsrLoco_tep70khar-eng.sms" )
	)

	Engine ( rz_tep70-0384
	Effects (
		DieselSpecialEffects (
			Exhaust1 ( 0.3 5.32 -2.77
					0 1 0
					0.1
				)
			Exhaust2 (	-0.1 5.32 -2.77
					0 1 0
					0.1
				)
			)
        	)

        Comment(Don't try to set "real" values of MaxForce and ContiniousForce - it will ruin physics)
        Comment(With these settings loco achieves continious speed 50km/h and tractive effort 167kN)

      Wagon ( rz_tep70-0384 )
	Type ( Diesel )
	MaxPower ( 2295kW )
	MaxForce ( 360kN )
	MaxContinuousForce ( 360kN )
	MaxDieselLevel( 6955l ) 
	MaxVelocity ( 108mph )
	MaxCurrent ( 1000A )
	WheelRadius ( 0.61m )
	Sanding ( 16mph )
	NumWheels ( 12 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	AirBrakesAirCompressorPowerRating( 1.5 )
	AirBrakesMainMinResAirPressure( 56 )
	AirBrakesMainMaxAirPressure( 121 )
	AirBrakesCompressorRestartPressure( 106 )
	AirBrakesMainResVolume( 35 )
	AirBrakesAirCompressorWattage( 40kW )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 2.75 )
	AirBrakesHasLowPressureTest( 0 )
	AirBrakesIsCompressorElectricOrMechanical( 0 )

	EngineBrakesControllerMinPressureReduction( 0 )
	TrainBrakesControllerMinPressureReduction( 0 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 2.5 )
	EngineBrakesControllerMaxApplicationRate( 2 )
	TrainBrakesControllerMaxApplicationRate( 1.7 )
	EngineBrakesControllerMaxReleaseRate( 2 )
	TrainBrakesControllerMaxReleaseRate( 1.5 )
	EngineBrakesControllerEmergencyApplicationRate( 15 )
	TrainBrakesControllerEmergencyApplicationRate( 10 )
	
	EngineBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMinSystemPressure( 0 )
	EngineBrakesControllerMaxSystemPressure( 73 )
	TrainBrakesControllerMaxSystemPressure( 73 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
	EngineBrakesControllerFullServicePressureDrop( 22 )
	TrainBrakesControllerFullServicePressureDrop( 5 )

	DynamicBrakesMaximumEffectiveSpeed( 45 )
	DynamicBrakesMaximumForce( 180kN )
	DynamicBrakesResistorCurrentLimit ( 620 )
	DynamicBrakesFadingSpeed( 35 )
	DynamicBrakesCutInSpeed( 10 )
	DynamicBrakesMinUsableSpeed( 9 )
	DynamicBrakesMaxAirBrakePressure ( 22 )
	DynamicBrakesDelayTimeBeforeEngaging ( 6 )
	DynamicBrakesMaximumSpeedForFadeOut ( 108 )
	DynamicBrakesEffectAtMaximumFadeOut( 0.15 )
	DynamicBrakesHigherSpeedCurveExponent( 1.5 )
	DynamicBrakesLowerSpeedCurveExponent( 2 )
	DynamicBrakesNumberOfControllerNotches( 8 )
	DynamicBrakeHasAutoBailOff( 1 )

	BrakesEngineBrakeType( "Air_single_pipe" )
	BrakesTrainBrakeType( "Air_single_pipe" )
	BrakesEngineControllers( "Independent, Train, Dynamic" )

	EngineBrakesControllerDirectControlExponent( 1 )
	
	CabView ( "../../tsrLoco_TEP70-Alias/Cabview_6/tsrLoco_tep70_patch.cvf" )
	HeadOut (  1.9 3.6 9.3 )

	MaxDieselLevel ( 6955l )
	DieselUsedPerHourAtMaxPower ( 620l )
	DieselUsedPerHourAtIdle ( 17l )
	EngineVariables ( 1529.6 )

	DieselSmokeEffectInitialMagnitude( 1 )
	DieselSmokeEffectMaxMagnitude( 4 )
	DieselSmokeEffectInitialSmokeRate( 1 )
	DieselSmokeEffectMaxSmokeRate( 3 )

	DieselEngineIdleRPM( 350 )
	DieselEngineMaxRPM( 1000 )
	DieselEngineSpeedOfMaxTractiveEffort( 2mph )
	DieselEngineMaxRPMChangeRate( 30 )
	
	DoesBrakeCutPower( 0 )
	BrakeCutsPowerAtBrakeCylinderPressure ( 12 )
	MaxSandingTime( 8815 )
	DoesHornTriggerBell( 0 )

	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 1 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 102 )
		MonitoringDeviceAlarmTimeLimit( 90 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceResetOnZeroSpeed( 1 )
		)
	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 130 )
		MonitoringDeviceResetLevel( 0.1 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceAlarmTimeBeforeOverSpeed( 5 )
		MonitoringDeviceDoesSuppressionReset( 0 )
		MonitoringDeviceTriggerOnOverspeed( 128 )
		MonitoringDeviceResetOnZeroSpeed( 1 )
		MonitoringDeviceResetOnResetButton( 0 )
		)

	EngineControllers (
   		Throttle ( 0 1 0.04 0 
			NumNotches ( 16
				Notch ( 0	  0 Dummy )
				Notch ( 0.10  0 Dummy )
				Notch ( 0.18  0 Dummy )
				Notch ( 0.24  0 Dummy )	
				Notch ( 0.29  0 Dummy )
				Notch ( 0.34  0 Dummy )
				Notch ( 0.40  0 Dummy )
				Notch ( 0.46  0 Dummy )
				Notch ( 0.53  0 Dummy )
				Notch ( 0.60  0 Dummy )
				Notch ( 0.66  0 Dummy )
				Notch ( 0.72  0 Dummy )
				Notch ( 0.80  0 Dummy )
				Notch ( 0.88  0 Dummy )
				Notch ( 0.94  0 Dummy )
				Notch ( 1	  0 Dummy )
			)
		)
		Brake_Dynamic ( 0 1 0.142 0
                	NumNotches ( 8
                    	Notch ( 0       0 Dummy )                    
                    	Notch ( 0.142   0 Dummy )
                    	Notch ( 0.285   0 Dummy )
                    	Notch ( 0.428   0 Dummy )
                    	Notch ( 0.571   0 Dummy )
                    	Notch ( 0.714   0 Dummy )
                    	Notch ( 0.857   0 Dummy )
                    	Notch ( 1   0 Dummy )
                	)
           	)
		Brake_Train ( 0 1 0.01 0.2 
			NumNotches ( 5
				Notch ( 0	 0 TrainBrakesControllerReleaseStart )
				Notch ( 0.2	 0 TrainBrakesControllerRunningStart )
				Notch ( 0.3	 0 TrainBrakesControllerHoldLappedStart )
				Notch ( 0.9	 0 TrainBrakesControllerFullServiceStart )
				Notch ( 1	 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Brake_Engine ( 0 0.75 0.147 0.75
			NumNotches ( 5
				Notch ( 0	   0 EngineBrakesControllerReleaseStart ) 
				Notch ( 0.147  0 EngineBrakesControllerApplyStart ) 
				Notch ( 0.293  0 EngineBrakesControllerApplyStart ) 
				Notch ( 0.517  0 EngineBrakesControllerApplyStart ) 
				Notch ( 0.750  0 EngineBrakesControllerApplyStart ) 
			)
		)
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )

     	Sound ( "../../tsrLoco_TEP70-Alias/Sound_2/tsrLoco_tep70khar-cab.sms" )

    	Name ( "TEP70-0384" )
    	Description (
	"The TEP70 is a series of Soviet/Russian passenger diesel locomotives.\n"+
	"TEP70 was introduced in 1973 and initially was designed as a deep modernization of less powerful  TEP60-series, but showed poor performance. Only seven locomotives of this type were built.\n"+
	"Since №0008 design of this series was based on TEP75-platform, so TEP70s became the pretty good passenger locomotives of Russian railways for years. At present replaced at production by modernized TEP70BS-series.\n"+
	"TEP70 locomotives were produced at Kolomna in 1973-1975 and in 1977-2006. In total 576 locos were built.\n"+
	"This very in-game model represents the TEP70 of late design of second phase.\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power: 4000 hp (2940 kW)\n\n"+
	"Max. speed: 160 km/h\n\n"+
	"Max. tractive effort: 288kN\n\n"+
	"Cont. tractive effort: 167kN\n\n"+
	"Cont. speed: 50 km/h\n\n"+
	"Power source: Diesel engine type 2A-5D49 - 4-stroke turbocharged with air intercooler, 16 cylinders in V-type arrangement \n\n"+
	"Traction motors: Six DC electric motors, type ED121A\n\n"+
	"Wheel configuration: Twelve 1220 mm diameter in Co-Co configuration\n\n"+
	"Height: 4,98 m\n\n"+
	"Width: 3,08 m\n\n"+
	"Length: 21,7 m\n\n"+
	"Weight: 135 tons"	
 	)

EngineOperatingProcedures (
    	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1. Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"3.	Release the brakes.\n"+
	"4.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
    	) 
)
